{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8192"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block/conv2d/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_1/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_1/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_2/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_2/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_3/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_3/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gan_model/generator_model/reshape/Shape", "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack", "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack_1", "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice", "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/1", "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/2", "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/leaky_re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/gan_model/generator_model/leaky_re_lu_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/Shape", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/2", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/gan_model/generator_model/leaky_re_lu_2/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/leaky_re_lu_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/leaky_re_lu_3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/Shape", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/leaky_re_lu_3/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/leaky_re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/leaky_re_lu_4/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/Shape", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/leaky_re_lu_4/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/leaky_re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/leaky_re_lu_5/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/Shape", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/leaky_re_lu_5/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Mul", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/leaky_re_lu_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/leaky_re_lu_6/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/Shape", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/leaky_re_lu_6/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/conv2d_transpose", "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block/leaky_re_lu_7/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/Tanh", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block/conv2d/Conv2D_weights", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_1/leaky_re_lu_8/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_1/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_1/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_2/leaky_re_lu_9/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_1/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_2/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_2/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_3/leaky_re_lu_10/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_2/leaky_re_lu_9/LeakyRelu", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_3/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_3/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/conv2d_block_3/leaky_re_lu_10/LeakyRelu", "StatefulPartitionedCall/gan_model/discriminator_model/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/flatten/Reshape", "StatefulPartitionedCall/gan_model/discriminator_model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/gan_model/discriminator_model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/gan_model/discriminator_model/dense/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/gan_model/discriminator_model/dense/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 512, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gan_model/generator_model/conv2d_transpose_4/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": 