{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_model/reshape/Shape", "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack", "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack_1", "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/generator_model/reshape/strided_slice", "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/1", "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/2", "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/generator_model/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/leaky_re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/generator_model/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_model/leaky_re_lu_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/Shape", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/2", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_model/leaky_re_lu_2/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/leaky_re_lu_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block/leaky_re_lu_3/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/Shape", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_model/conv2d_transpose_block/leaky_re_lu_3/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/leaky_re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/leaky_re_lu_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/Shape", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/leaky_re_lu_4/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/leaky_re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/leaky_re_lu_5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/Shape", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/leaky_re_lu_5/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/leaky_re_lu_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/leaky_re_lu_6/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_4/Shape", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/leaky_re_lu_6/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_4/conv2d_transpose", "StatefulPartitionedCall/generator_model/conv2d_transpose_4/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/generator_model/conv2d_transpose_4/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/conv2d_transpose/ReadVariableOp", "shape": [4, 4, 512, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/conv2d_transpose/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/conv2d_transpose_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/conv2d_transpose_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/conv2d_transpose_3/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_4/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_3/batch_normalization_3/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_2/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block_1/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Scaled", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/generator_model/conv2d_transpose_block/batch_normalization/FusedBatchNormV3/Offset", "shape": [512], "dtype": "float32"}]}]}